neverhover/micropython/ports/esp32/boards/HelTec/mpconfigboard.h


#define MICROPY_HW_BOARD_NAME       "HelTec"
#define MICROPY_HW_MCU_NAME         "LORA"

// SPI busses
#define MICROPY_HW_SPI1_NSS     (18)
#define MICROPY_HW_SPI1_SCK     (5)
#define MICROPY_HW_SPI1_MISO    (19)
#define MICROPY_HW_SPI1_MOSI    (27)
#define MICROPY_HW_SPI1_RESET   (14)
#define MICROPY_HW_LORA_DIO0    (26)
#define MICROPY_HW_LORA_DIO1    (-1)
#define MICROPY_HW_LORA_DIO2    (-1)
#define MICROPY_HW_LORA_DIO3    (-1)
#define MICROPY_HW_LORA_DIO4    (-1)
#define MICROPY_HW_LORA_DIO5    (-1)

//Normal GPIO
#define MICROPY_HW_GPIO_LED     (25)

#define LORA_RADIO_SX1278